# PIVOTING AND RESHAPING DATA

In [1]:
import numpy as np
import pandas as pd

In [2]:
sales = pd.read_csv("./data/sales_by_employee.csv", parse_dates=["Date"])
sales

C:\Users\singa\AppData\Local\Temp\ipykernel_16296\922729750.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sales = pd.read_csv("./data/sales_by_employee.csv", parse_dates=["Date"])

         Date     Name           Customer  Revenue  Expenses
0  2020-01-01    Oscar      Logistics XYZ     5250       531
1  2020-01-01    Oscar        Money Corp.     4406       661
2  2020-01-02    Oscar         PaperMaven     8661      1401
3  2020-01-03    Oscar        PaperGenius     7075       906
4  2020-01-04    Oscar        Paper Pound     2524      1767
5  2020-01-05    Oscar        Paper Pound     2793       624
6  2020-01-01  Michael      Logistics XYZ     7172       412
7  2020-01-02  Michael        PaperGenius     6362       685
8  2020-01-03  Michael        PaperGenius     5982      1772
9  2020-01-04  Michael     Best Paper Co.     7917      1857
10 2020-01-05  Michael     Best Paper Co.     7837      1633
11 2020-01-01      Jim        PaperGenius     1864      1305
12 2020-01-02      Jim        Money Corp.     8278       462
13 2020-01-03      Jim        Paper Pound     4226      1923
14 2020-01-04      Jim         PaperMaven     3868      1889
15 2020-01-04      Jim  Average Paper Co.     2287       426
16 2020-01-01   Dwight        PaperGenius     2639       368
17 2020-01-03   Dwight      Logistics XYZ     4951       758
18 2020-01-03   Dwight     Best Paper Co.     2703      1321
19 2020-01-03   Dwight      Logistics XYZ     4258      1202
20 2020-01-05   Dwight        Paper Pound     7771      1475
21 2020-01-01    Creed        Money Corp.     4430       548
22 2020-01-02    Creed  Average Paper Co.     8026      1906
23 2020-01-02    Creed  Average Paper Co.     5188      1768
24 2020-01-04    Creed         PaperMaven     3144      1314
25 2020-01-05    Creed        Money Corp.      938      1053

In [3]:
# Create a pivot table using pivot_table() method
sales.pivot_table(
    index="Date",
    values="Revenue",
    aggfunc="sum"
)

            Revenue
Date
2020-01-01    25761
2020-01-02    36515
2020-01-03    29195
2020-01-04    19740
2020-01-05    19339

In [4]:
# Create a pivot table using pivot_table() method
sales.pivot_table(
    index="Date",
    values="Revenue",
    aggfunc="mean"
)

                Revenue
Date
2020-01-01  4293.500000
2020-01-02  7303.000000
2020-01-03  4865.833333
2020-01-04  3948.000000
2020-01-05  4834.750000

In [5]:
sales.pivot_table(
    index="Date",
    values="Revenue",
    aggfunc=["sum", "mean", "count", "min", "max"]
)

               sum         mean   count     min     max
           Revenue      Revenue Revenue Revenue Revenue
Date
2020-01-01   25761  4293.500000       6    1864    7172
2020-01-02   36515  7303.000000       5    5188    8661
2020-01-03   29195  4865.833333       6    2703    7075
2020-01-04   19740  3948.000000       5    2287    7917
2020-01-05   19339  4834.750000       4     938    7837

In [6]:
sales.pivot_table(
    index=["Date", "Customer"],
    values="Revenue",
    aggfunc=["sum", "mean"]
)

                                 sum    mean
                             Revenue Revenue
Date       Customer
2020-01-01 Logistics XYZ       12422  6211.0
           Money Corp.          8836  4418.0
           PaperGenius          4503  2251.5
2020-01-02 Average Paper Co.   13214  6607.0
           Money Corp.          8278  8278.0
           PaperGenius          6362  6362.0
           PaperMaven           8661  8661.0
2020-01-03 Best Paper Co.       2703  2703.0
           Logistics XYZ        9209  4604.5
           Paper Pound          4226  4226.0
           PaperGenius         13057  6528.5
2020-01-04 Average Paper Co.    2287  2287.0
           Best Paper Co.       7917  7917.0
           Paper Pound          2524  2524.0
           PaperMaven           7012  3506.0
2020-01-05 Best Paper Co.       7837  7837.0
           Money Corp.           938   938.0
           Paper Pound         10564  5282.0

In [7]:
sales.pivot_table(
    index="Date",
    columns="Customer",
    values="Revenue",
    aggfunc="mean"
)

Customer,Average Paper Co.,Best Paper Co.,Logistics XYZ,Money Corp.,Paper Pound,PaperGenius,PaperMaven
Date,,,,,,,
2020-01-01,NaN,NaN,6211.0,4418.0,NaN,2251.5,NaN
2020-01-02,6607.0,NaN,NaN,8278.0,NaN,6362.0,8661.0
2020-01-03,NaN,2703.0,4604.5,NaN,4226.0,6528.5,NaN
2020-01-04,2287.0,7917.0,NaN,NaN,2524.0,NaN,3506.0
2020-01-05,NaN,7837.0,NaN,938.0,5282.0,NaN,NaN

In [8]:
sales.pivot_table(
    index="Date",
    columns="Customer",
    values="Revenue",
    aggfunc="mean",
    fill_value = ""
)

Customer,Average Paper Co.,Best Paper Co.,Logistics XYZ,Money Corp.,Paper Pound,PaperGenius,PaperMaven
Date,,,,,,,
2020-01-01,,,6211.0,4418.0,,2251.5,
2020-01-02,6607.0,,,8278.0,,6362.0,8661.0
2020-01-03,,2703.0,4604.5,,4226.0,6528.5,
2020-01-04,2287.0,7917.0,,,2524.0,,3506.0
2020-01-05,,7837.0,,938.0,5282.0,,

In [9]:
sales.pivot_table(
    index="Date",
    columns=["Customer","Name"],
    values="Revenue",
    aggfunc="mean",
    fill_value = ""
)

Customer   Average Paper Co.         Best Paper Co.         Logistics XYZ  \
Name                   Creed     Jim         Dwight Michael        Dwight
Date
2020-01-01
2020-01-02            6607.0
2020-01-03                                   2703.0                4604.5
2020-01-04                    2287.0                 7917.0
2020-01-05                                           7837.0

Customer                   Money Corp.                 Paper Pound          \
Name       Michael   Oscar       Creed     Jim   Oscar      Dwight     Jim
Date
2020-01-01  7172.0  5250.0      4430.0          4406.0
2020-01-02                              8278.0
2020-01-03                                                          4226.0
2020-01-04
2020-01-05                       938.0                      7771.0

Customer           PaperGenius                         PaperMaven          \
Name         Oscar      Dwight     Jim Michael   Oscar      Creed     Jim
Date
2020-01-01              2639.0  1864.0
2020-01-02                              6362.0
2020-01-03                              5982.0  7075.0
2020-01-04  2524.0                                         3144.0  3868.0
2020-01-05  2793.0

Customer
Name         Oscar
Date
2020-01-01
2020-01-02  8661.0
2020-01-03
2020-01-04
2020-01-05

In [16]:
sales.pivot_table(
    index="Date",
    values=["Revenue", "Expenses"],
    aggfunc={"Revenue":"sum", "Expenses":"mean"},
    fill_value = ""
)

               Expenses  Revenue
Date
2020-01-01   637.500000    25761
2020-01-02  1244.400000    36515
2020-01-03  1313.666667    29195
2020-01-04  1450.600000    19740
2020-01-05  1196.250000    19339

In [19]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values= "Revenue",
    aggfunc="sum",
    fill_value = "",
    margins = True,
    margins_name = "Total"
)

C:\Users\singa\AppData\Local\Temp\ipykernel_16296\1499720030.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  sales.pivot_table(

Name                 Creed Dwight    Jim Michael  Oscar   Total
Date
2020-01-01 00:00:00   4430   2639   1864    7172   9656   25761
2020-01-02 00:00:00  13214          8278    6362   8661   36515
2020-01-03 00:00:00         11912   4226    5982   7075   29195
2020-01-04 00:00:00   3144          6155    7917   2524   19740
2020-01-05 00:00:00    938   7771           7837   2793   19339
Total                21726  22322  20523   35270  30709  130550

In [20]:
by_name_and_date = sales.pivot_table(
    index="Name",
    columns="Date",
    values="Revenue",
    aggfunc="sum"
)
by_name_and_date

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed        4430.0     13214.0         NaN      3144.0       938.0
Dwight       2639.0         NaN     11912.0         NaN      7771.0
Jim          1864.0      8278.0      4226.0      6155.0         NaN
Michael      7172.0      6362.0      5982.0      7917.0      7837.0
Oscar        9656.0      8661.0      7075.0      2524.0      2793.0

In [22]:
# following is stacking the pivot data
stacked = by_name_and_date.stack()
stacked

Name     Date
Creed    2020-01-01     4430.0
         2020-01-02    13214.0
         2020-01-04     3144.0
         2020-01-05      938.0
Dwight   2020-01-01     2639.0
         2020-01-03    11912.0
         2020-01-05     7771.0
Jim      2020-01-01     1864.0
         2020-01-02     8278.0
         2020-01-03     4226.0
         2020-01-04     6155.0
Michael  2020-01-01     7172.0
         2020-01-02     6362.0
         2020-01-03     5982.0
         2020-01-04     7917.0
         2020-01-05     7837.0
Oscar    2020-01-01     9656.0
         2020-01-02     8661.0
         2020-01-03     7075.0
         2020-01-04     2524.0
         2020-01-05     2793.0
dtype: float64

In [23]:
# unstacking the given data
stacked.unstack()

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed        4430.0     13214.0         NaN      3144.0       938.0
Dwight       2639.0         NaN     11912.0         NaN      7771.0
Jim          1864.0      8278.0      4226.0      6155.0         NaN
Michael      7172.0      6362.0      5982.0      7917.0      7837.0
Oscar        9656.0      8661.0      7075.0      2524.0      2793.0

### Melting a dataset

In [24]:
video_game_sales = pd.read_csv("./data/video_game_sales.csv")
video_game_sales

,Name,NA,EU,JP,Other
0,Wii Sports,41.49,29.02,3.77,8.46
1,Super Mario Bros.,29.08,3.58,6.81,0.77
2,Mario Kart Wii,15.85,12.88,3.79,3.31
3,Wii Sports Resort,15.75,11.01,3.28,2.96
4,Pokemon Red/Pokemon Blue,11.27,8.89,10.22,1.00
...,...,...,...,...,...
16561,Woody Woodpecker in Crazy Castle 5,0.01,0.00,0.00,0.00
16562,Men in Black II: Alien Escape,0.01,0.00,0.00,0.00
16563,SCORE International Baja 1000: The Official Game,0.00,0.00,0.00,0.00
16564,Know How 2,0.00,0.01,0.00,0.00
16565,Spirits & Spells,0.01,0.00,0.00,0.00

In [26]:
# melting the data
video_game_sales.melt(
    id_vars = "Name",
    value_vars = ["NA", "EU", "JP", "Other"],
    var_name = "Region",
    value_name = "Sales"
)

                                                   Name Region  Sales
0                                            Wii Sports     NA  41.49
1                                     Super Mario Bros.     NA  29.08
2                                        Mario Kart Wii     NA  15.85
3                                     Wii Sports Resort     NA  15.75
4                              Pokemon Red/Pokemon Blue     NA  11.27
...                                                 ...    ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other   0.00
66260                     Men in Black II: Alien Escape  Other   0.00
66261  SCORE International Baja 1000: The Official Game  Other   0.00
66262                                        Know How 2  Other   0.00
66263                                  Spirits & Spells  Other   0.00

[66264 rows x 3 columns]

### Exploding dataset

In [27]:
recipes = pd.read_csv("./data/recipes.csv")
recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

In [28]:
recipes["Ingredients"] = recipes["Ingredients"].str.split(pat=",")
recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  [Apricot preserves,  Dijon mustard,  curry pow...
1      Tomato Basil Salmon  [Salmon filets,  basil,  tomato,  olive oil,  ...
2  Parmesan Cheese Chicken  [Bread crumbs,  Parmesan cheese,  Italian seas...

In [29]:
recipes.explode("Ingredients")

                    Recipe         Ingredients
0   Cashew Crusted Chicken   Apricot preserves
0   Cashew Crusted Chicken       Dijon mustard
0   Cashew Crusted Chicken        curry powder
0   Cashew Crusted Chicken     chicken breasts
0   Cashew Crusted Chicken             cashews
1      Tomato Basil Salmon       Salmon filets
1      Tomato Basil Salmon               basil
1      Tomato Basil Salmon              tomato
1      Tomato Basil Salmon           olive oil
1      Tomato Basil Salmon     Parmesan cheese
2  Parmesan Cheese Chicken        Bread crumbs
2  Parmesan Cheese Chicken     Parmesan cheese
2  Parmesan Cheese Chicken   Italian seasoning
2  Parmesan Cheese Chicken                 egg
2  Parmesan Cheese Chicken     chicken breasts